In [1]:
import sqlalchemy as db
from getpass import getpass

In [2]:
password = getpass("Mysql Password: ")

Mysql Password:  ···········

In [3]:
dbName = "publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [4]:
engine = db.create_engine(connectionData)

In [5]:
import pandas as pd

In [6]:
###CHALLENGE 1
#Igual que BONUS en lab-mysql-select

df = pd.read_sql_query("""
SELECT au.au_id AS Author_id,
		au_lname AS Last_name,
        au_fname AS First_name,
        IFNULL(ROUND(SUM(per_title.total_advance + per_title.total_sells),2), 0) AS total_profit
	FROM authors AS au
	LEFT JOIN (SELECT t.title_id, 
					(advance * (royalty/100) * (royaltyper/100)) AS total_advance,
					(price * (royalty/100)*(royaltyper/100)) * cant.cantidad AS total_sells,
					tau.au_id
				FROM titles AS t
					LEFT JOIN titleauthor AS tau
						ON t.title_id = tau.title_id
					LEFT JOIN (SELECT t.title_id,
										SUM(s.qty) AS cantidad
									FROM titles AS t
									LEFT JOIN sales AS s
										ON t.title_id = s.title_id
								GROUP BY t.title_id
							) AS cant
							ON t.title_id = cant.title_id
				) AS per_title
					ON au.au_id = per_title.au_id
GROUP BY Author_id
ORDER BY total_profit DESC;
""", engine
)
df.head(3)

     Author_id Last_name First_name  total_profit
0  722-51-5454  DeFrance     Michel       2721.53
1  213-46-8915     Green   Marjorie       2667.11
2  238-95-7766    Carson     Cheryl       1230.16

In [10]:
##CHALLENGE 2
#No se si estoy en lo correcto, pero después de investigar y leer la documentación de read_sql_query de pandas, 
#creo que no acepta varias estancias como para hacer el ejercicio con temporary tables. Este es el código mysql. No lo 
#he puesto en un .sql por no añadir más ficheros a la PR, pero puedo hacerlo si es necesario.

"""
CREATE TEMPORARY TABLE numberbookssold AS
SELECT t.title_id,
		SUM(s.qty) AS cantidad
	FROM titles AS t
	LEFT JOIN sales AS s
		ON t.title_id = s.title_id
GROUP BY t.title_id;

CREATE TEMPORARY TABLE profitpertitle AS
SELECT t.title_id, 
		(advance * (royalty/100) * (royaltyper/100)) AS total_advance,
		(price * (royalty/100)*(royaltyper/100)) * cant.cantidad AS total_sells,
		tau.au_id
	FROM titles AS t
		LEFT JOIN titleauthor AS tau
			ON t.title_id = tau.title_id
		LEFT JOIN numberbookssold AS cant
				ON t.title_id = cant.title_id;
                
SELECT au.au_id AS Author_id,
		au_lname AS Last_name,
        au_fname AS First_name,
        IFNULL(ROUND(SUM(per_title.total_advance + per_title.total_sells),2), 0) AS total_profit
	FROM authors AS au
	LEFT JOIN profitpertitle AS per_title
		ON au.au_id = per_title.au_id
GROUP BY Author_id
ORDER BY total_profit DESC;
"""

'\nCREATE TEMPORARY TABLE numberbookssold AS\nSELECT t.title_id,\n\t\tSUM(s.qty) AS cantidad\n\tFROM titles AS t\n\tLEFT JOIN sales AS s\n\t\tON t.title_id = s.title_id\nGROUP BY t.title_id;\n\nCREATE TEMPORARY TABLE profitpertitle AS\nSELECT t.title_id, \n\t\t(advance * (royalty/100) * (royaltyper/100)) AS total_advance,\n\t\t(price * (royalty/100)*(royaltyper/100)) * cant.cantidad AS total_sells,\n\t\ttau.au_id\n\tFROM titles AS t\n\t\tLEFT JOIN titleauthor AS tau\n\t\t\tON t.title_id = tau.title_id\n\t\tLEFT JOIN numberbookssold AS cant\n\t\t\t\tON t.title_id = cant.title_id;\n                \nSELECT au.au_id AS Author_id,\n\t\tau_lname AS Last_name,\n        au_fname AS First_name,\n        IFNULL(ROUND(SUM(per_title.total_advance + per_title.total_sells),2), 0) AS total_profit\n\tFROM authors AS au\n\tLEFT JOIN profitpertitle AS per_title\n\t\tON au.au_id = per_title.au_id\nGROUP BY Author_id\nORDER BY total_profit DESC;\n'

In [12]:
##CHALLENGE 3
##Este código guarda la tabla que se pide en un pandas DataFrame.
#Para guardar la tabla de forma permanente en la base de datos hay que añadir a la primera linea:
#CREATE TABLE most_profiting_authors AS
#Si se incluye en esta query, lo que devuelve es un objeto (la tabla), con lo cual la función falla.
df2 = pd.read_sql_query("""
	SELECT tab.Author_id, tab.total_profit FROM	(
        SELECT au.au_id AS Author_id,
				au_lname AS Last_name,
				au_fname AS First_name,
				IFNULL(ROUND(SUM(per_title.total_advance + per_title.total_sells),2), 0) AS total_profit
			FROM authors AS au
			LEFT JOIN (SELECT t.title_id, 
							(advance * (royalty/100) * (royaltyper/100)) AS total_advance,
							(price * (royalty/100)*(royaltyper/100)) * cant.cantidad AS total_sells,
							tau.au_id
						FROM titles AS t
							LEFT JOIN titleauthor AS tau
								ON t.title_id = tau.title_id
							LEFT JOIN (SELECT t.title_id,
												SUM(s.qty) AS cantidad
											FROM titles AS t
											LEFT JOIN sales AS s
												ON t.title_id = s.title_id
										GROUP BY t.title_id
									) AS cant
									ON t.title_id = cant.title_id
						) AS per_title
							ON au.au_id = per_title.au_id
		GROUP BY Author_id
		ORDER BY total_profit DESC) AS tab;
""",engine)
df2

      Author_id  total_profit
0   722-51-5454       2721.53
1   213-46-8915       2667.11
2   238-95-7766       1230.16
3   899-46-2035       1114.63
4   998-72-3567        824.96
5   807-91-6654        783.80
6   648-92-1872        593.46
7   756-30-7391        557.39
8   274-80-9391        529.99
9   724-80-9391        503.72
10  267-41-2394        460.94
11  427-17-2319        450.00
12  846-92-7186        450.00
13  486-29-1786        419.98
14  672-71-3249        331.99
15  409-56-7008        317.99
16  472-27-2349        248.99
17  172-32-1176        229.99
18  712-45-1867         23.99
19  724-08-9931          0.00
20  527-72-3246          0.00
21  893-72-1158          0.00
22  341-22-1782          0.00